<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Dashboard Language Lines
    |--------------------------------------------------------------------------
    */
    /* dashboard page */
    'todays-Registered-users' => "المستخدمين المسجلين اليوم",
    'total-Registered-users'=> "مجموع المستخدمين المسجلين",
    'todays-loggedin-users'=> "عدد المستخدمين تم تسجيل دخولهم",

    'todays-requested-items' => 'المفقودات المطلوبة اليوم',
    'total-requested-items' => 'مجموع المفقودات المطلوبة',
    'todays-actioned-requests' => 'الطلبات المتنفذة اليوم',
    'pending-requests' => 'الطلبات المعلقة',
    'waiting-payment' => 'في انتظار الدفع',
    'delivered-requests' => 'الطلبات المسلمة',
    'cancelled-requests' => 'الطلبات الملغاة',
    'pages'=> 'صفحة',
    'signout'=> 'تسجيل الخروج',

    /* profile page */
    'profile-information' => 'معلومات الحساب',
    'fullname' => 'الاسم الكامل',
    'email' => 'البريد الإلكتروني',
    'phone' => 'رقم الهاتف',
    'location' => 'الموقع',
    'aboutme' => 'نبذة عني',
    'ssau' => 'قدم وصفًا عن نفسك',
    'save-changes' => 'حفظ التغييرات',

    /* Store Items Page */
    'item-name' => 'اسم العنصر',
    'wallet' => 'المحفظة',
    'color' => 'اللون',
    'black' => 'أسود',
    'city' => 'المدينة',
    'place' => 'المكان',
    'category' => 'الفئة',
    'sub-category' => 'الفئة الفرعية',
    'date' => 'التاريخ',
    'time' => 'الوقت',
    'description' => 'الوصف',
    'image' => 'الصورة',
    'submit' => 'إرسال',
    'select-an-option' => 'اختر',
    'weight'=> 'الوزن (قرام)',
    'weight-placeholder'=> '120',


    /* Lost Items List Page */
    'all-items' => 'جميع العناصر المفقودة',
    'id' => 'المعرف',
    'photo' => 'الصورة',
    'item' => 'العنصر',
    'address' => 'العنوان',
    'lost-datetime' => 'تاريخ/وقت الفقدان',
    'create-datetime' => 'تاريخ/وقت الإنشاء',
    'status' => 'الحالة',
    'qrcode' => 'رمز الاستجابة السريعة (QR)',
    'action' => 'إجراء',
    'print-qrcode' => 'طباعة رمز الاستجابة السريعة (QR)',
    'show' => 'عرض',
    'pending'=> 'قيد الانتظار',
    'waiting-for-verification'=> 'بإنتظار التحقق',
    'waiting-for-payment'=> 'بإنتظار الدفع',
    'cancelled'=> 'ملغي',
    'delivered'=> 'تم التوصيل',
    'added-by-name'=> 'اٌضيف بواسطة (الاسم)',
    'added-by-email'=> 'اُضيف بواسطة (الايميل)',

    /* Show Item Page */
    'show-item-image'=> 'صورة العنصر: ',
    'show-status'=> 'الحاله: ',
    
    /* side bar */

    'corprator-services' => 'خدمات الشركة',
    'dashboard' => 'لوحة التحكم',
    'profile' => 'الملف الشخصي',

    'admin-services'=> 'خدمات الاداريين',
    'users'=> 'المستخدمين',
    'admin-users'=> 'المستخدمين الاداريين',
    'corporators-users'=> 'المستخدمين الشركات',
    'ACTP'=> 'تعيين مكان لشركة',
    'configurations'=> 'الاعدادات',
    'cities'=> 'المدن',
    'places'=> 'الاماكن',
    'categories'=> 'الفئات',
    'sub-categories'=> 'الفئات الفرعية',

    'items-base' => 'قاعدة المفقودات',
    'store-items' => 'اضافة مفقودات',
    'lost-items-list' => 'قائمة المفقودات',

    'item-requests' => 'طلبات العناصر',
    'requested-items' => 'قائمة المفقودات المطلوبة',

    'user-services'=> 'خدمات المستخدم',
    'find-item'=> 'بحث عن مفقودات',
    'find-item-requests'=> 'طلبات المفقودات',

    /*messages */
    
    'no-places-found' => 'لم يتم العثور على أماكن للمستخدم',
    'city-not-found' => 'لم يتم العثور على مدينة للمستخدم',
    'language-changed'=> 'تم تغيير اللغة بنجاح.',
    'invalid-lang'=> 'قمت باختيار لغة غير صحيحة',
    'profile-updated-successfully'=> 'تم تحديث الملف الشخصي بنجاح',
    'invalid-credentials' => 'البريد الإلكتروني أو كلمة المرور غير صحيحة.',
    'logged-out' => 'لقد تم تسجيل خروجك.',
    'status-updated-success' => 'تم تحديث حالة العنصر المفقود بنجاح.',
    'admin-user-created' => 'تم إنشاء مستخدم المسؤول بنجاح!',
    'corprator-user-created' => 'تم إنشاء مستخدم الشركة بنجاح!',
    'status-updated' => 'تم تحديث الحالة بنجاح!',
    'user-assigned-success' => 'تم تعيين المستخدم إلى المكان بنجاح',
    'category-created-success'=> 'تم انشاء الفئة بنجاح',
    'city-created-success'=> 'تم انشاء المدينة بنجاح',
    'city-status-updated-successfully' => 'تم تحديث حالة المدينة بنجاح',
    'email-sent-successfully' => 'تم إرسال البريد الإلكتروني بنجاح',
    'item-request-created' => 'تم إنشاء طلب العنصر المفقود بنجاح!',
    'place-created-success' => 'تم إنشاء المكان بنجاح',
    'place-status-updated-success' => 'تم تحديث حالة المكان بنجاح!',
    'account-created' => 'تم إنشاء حسابك بنجاح.',
    'logged-in' => 'لقد قمت بتسجيل الدخول.',
    'account-disabled' => 'تم تعطيل حسابك.',
    'no-permission' => 'ليس لديك الإذن لتسجيل الدخول.',
    'sub-category-created-success' => 'تم إنشاء الفئة الفرعية بنجاح',
    'sub-category-status-updated-success' => 'تم تحديث حالة الفئة الفرعية بنجاح',

    /* HTML TAGS */
    'dir'=> 'rtl',
    'lang'=> 'ar',   
    'divme'=> 'ms-2',
    'spanms'=> 'me-1',
    'spanlogoms'=> 'me-3',

    /* Login Page */
    'welcome'=> 'مرحبًا',
    'get-to'=> 'انتقل إلى لوحة تحكم Return-ly',
    'please-enter-email'=> 'الرجاء إدخال عنوان بريدك الإلكتروني وكلمة المرور',
    'password'=> 'كلمة المرور',
    'remember-me'=> 'تذكرني',
    'signin'=> 'تسجيل الدخول',
    'forgot'=> 'هل نسيت كلمة المرور؟ إعادة تعيين كلمة المرور',
    'here'=> 'هنا',
    'dont-have-acc'=> "ليس لديك حساب؟",
    'signup'=> 'تسجيل مستخدم جديد',

    /* Sign up */
    'we-got-lost-items'=> 'لدينا تغطية لعملية فقدان الأشياء الخاصة بك.',
    'please-register'=> 'الرجاء التسجيل باستخدام عنوان بريدك الإلكتروني وكلمة المرور',
    'register'=> 'تسجيل',
    'agree'=> 'أنا أوافق على',
    'terms-and-conditions'=> 'الشروط والأحكام',
    'first-agree'=> 'أولاً، قم بالموافقة على الشروط والأحكام، ثم حاول التسجيل مرة أخرى.',
    'already-have-acc'=> 'هل لديك حساب بالفعل؟',
    'name'=> 'الأسم',
    
    /* forgot password */
    'change-password'=> 'تغيير كلمة المرور',
    'new-password'=> 'كلمة المرور الجديدة',
    'confirm-password'=> 'تأكيد كلمة المرور',
    'recover-password'=> 'استرجاع كلمة المرور الخاصة بك',
    'forgot-password'=> 'هل نسيت كلمة المرور؟ أدخل بريدك الإلكتروني هنا',

    /* Terms and conditions  */
    'terms-of-use'=> 'شروط الاستخدام',
    'terms-content-title-1'=> "شروط الاستخدام للمشغل ",
    'terms-content-date-1'=> "آخر تحديث: 1 ديسمبر 2023 ",
    'terms-content-1'=> "يرجى قراءة الشروط والأحكام التالية («الشروط») بعناية لأنها تنشئ عقدًا قانونيًا ملزمًا بينك وبين موظفيك ووكلائك والمقاولين وأي كيان آخر تقبل نيابة عنه هذه الشروط (بشكل جماعي، «أنت» أو «أنت») وRETURN-LY. («RETURN-LY» أو «نحن» أو «نحن») التي تحكم استخدامك لموقعنا على الإنترنت وأي ميزات ومحتوى ومنتجات وخدمات ذات صلة (مجتمعة، «خدمات»). إذا كنت لا توافق على جميع الشروط التالية الآن أو في المستقبل، فلا تستخدم الخدمات بأي شكل من الأشكال. من خلال الوصول إلى الخدمات بأي شكل من الأشكال، بما في ذلك عن طريق النقر فوق زر «قبول» (أو ما شابه) عن طريق إنشاء حساب، فأنت توافق على الشروط وتلتزم بها. إذا كنت تستخدم الخدمات نيابة عن صاحب العمل أو الآخرين، فأنت تمثل وتضمن أنك مخول بقبول الشروط نيابة عنهم.",

    'terms-content-title-2'=> "إشعار التحكيم",
    'terms-content-2'=> "باستثناء أنواع معينة من النزاعات الموصوفة في بند التحكيم أدناه، فإنك توافق على أن النزاعات بينك وبين RETURN-LY سيتم حلها عن طريق إلزامي بموجب القانون التجاري في مدينة الرياض في المملكة العربية السعودية. '1' الخدمات، بما في ذلك الشكل والمحتوى، و '2' المنتجات و/أو الخدمات على النحو المبين في الخدمات. يجوز لـ RETURN-LY إجراء مثل هذه التغييرات أو التعديلات على الأحكام والشروط الواردة هنا وسيشكل استخدامك المستمر للخدمات بعد التغييرات و/أو التعديلات قبولك لهذه التغييرات و/أو التعديلات. ستقدم RETURN-LY إشعارًا بهذه التغييرات من خلال نشر الشروط المحدثة على الخدمات وتغيير التاريخ «المحدث الأخير» المذكور أعلاه. أنت توافق على أن RETURN-LY قد تقدم إشعارًا عن طريق نشر إشعارات أو روابط للإشعارات على موقع RETURN-LY. وقمت بمراجعة التحديثات باستمرار.",

    'terms-content-title-3'=> "نظرة عامة وخدمة الوكيل",
    'terms-content-3'=> "تعمل RETURN-LY كمنصة من خلال تزويدك بالأدوات اللازمة لمساعدة المستخدمين في العثور على العناصر المفقودة. يرجى العلم أنه ما لم تكن قد وافقت على جعل RETURN-LY وكيلك بموجب اتفاقية خدمات منفصلة، فإن RETURN-LY ليس مسؤولاً عن ضمان إعادة العناصر إلى المستخدمين و/أو الجمهور (إذا كنت تستخدم برنامج RETURN-LY Lost & Found).",

    'terms-content-title-4'=> "الأهليــة",
    'terms-content-4'=> "لكي تكون مؤهلاً لاستخدام الخدمات، يجب عليك أنك تضمن وتستوفي المعايير التالية: (1) تبلغ من العمر 16 عامًا أو أكثر ؛ (2) لست مقيد/ة أو ممنوعـ/ة من استخدام الخدمات، (3) لست منافسـ/ة للخدمات أو مستخدمـ/ة لأسباب تنافس RETURN-LY ؛ (4) تمتلك السلطة الكاملة للدخول في الشروط ولن ينتهك ذلك أي اتفاق آخر أنت طرف فيه ؛ (5) لن ينتهك أي حقوق لـ RETURN-LY، بما في ذلك حقوق الملكية الفكرية مثل حقوق التأليف والنشر أو حقوق العلامات التجارية ؛ (6) الموافقة على توفير جميع المعدات (بما في ذلك جميع الأجهزة) والبرمجيات والوصول إلى الإنترنت اللازمة لاستخدام الخدمات، على نفقتك، ما لم يتم الاتفاق عليها بشكل منفصل من قبل RETURN-LY. أنت هنا تمثل أنك المستفيد المقصود من الخدمات. لا يمكنك الوصول إلى الخدمات و/أو استخدامها لأي غرض إذا كان أي من التمثيلات في الجملة السابقة غير صحيح.",

    'terms-content-title-5'=> "توافر الخدمات",
    'terms-content-5'=> "توافق على استخدام الخدمات فقط لإرسال و/أو تلقي محتوى ومواد غير مقيدة. قد تتعرض الخدمات للتوقف وفقدان البيانات وحذف البيانات والشروط التي تمنع التشغيل السليم للخدمات الناتجة عن ظروف أو أحداث خارج نطاق السيطرة المعقولة لـ RETURN-LY والتي لن تتحمل RETURN-LY أي مسؤولية عنها. يجوز تعديل الخدمات أو تحديثها في أي وقت دون إشعار أو مسؤولية.",

    'terms-content-title-6'=> "إنشاء الحساب",
    'terms-content-6'=> "لفتح حساب، يجب عليك إكمال عملية التسجيل من خلال تزويدنا بمعلومات حقيقية وحالية وكاملة ودقيقة بناءً على نموذج التسجيل المعمول به، وأنك ستحافظ على هذه المعلومات وتحديثها على الفور للحفاظ عليها صحيحة، وحديثة، وكاملة ودقيقة. إذا انتهكت أيًا من الشروط والأحكام و/أو القيود المنصوص عليها هنا، فيمكننا إنهاء حسابك. إذا أنهينا حسابك، يمكنك الاشتراك فقط في حساب جديد إذا قمنا بدعوتك رسميًا. وإذا كنت ترتكب الاحتيال أو تزوير المعلومات المتعلقة باستخدامك للخدمات أو فيما يتعلق بحساب RETURN-LY الخاص بك. في هذه الحالة، سيتم إنهاء حسابك على الفور ونحتفظ بالحق في تحميلك المسؤولية عن أي وجميع الأضرار التي نتعرض لها، ومتابعة الإجراءات القانونية من خلال سلطات إنفاذ القانون المحلية والوطنية ذات الصلة وإخطار «مزود خدمة الإنترنت الخاص بك» بأي نشاط احتيالي نربطه بك أو استخدامك للخدمات.",
    
    'terms-content-title-7'=> "الأنشطة تحت حسابك",
    'terms-content-7'=> "أنت مسؤول عن الحفاظ على سرية أي كلمة مرور (كلمات مرور) تستخدمها للوصول إلى الخدمات، وأنت مسؤول بالكامل عن جميع الأنشطة التي تحدث تحت كلمة المرور الخاصة بك وحسابك. أنت توافق على إخطار RETURN-LY على الفور بأي استخدام غير مصرح به لحسابك أو أي خرق آخر للأمن. لن تكون RETURN-LY مسؤولة عن أي خسارة قد تتكبدها نتيجة استخدام شخص آخر لكلمة المرور أو الحساب الخاص بك. على الرغم من هذا الإشعار، يمكن أن تكون مسؤولاً عن الخسائر التي تكبدتها RETURN-LY أو طرف آخر بسبب استخدام شخص آخر لحسابك أو كلمة السر الخاصة بك. لا يمكنك استخدام حساب أي شخص آخر في أي وقت، دون إذن صاحب الحساب.",

    'terms-content-title-8'=> "مسؤولياتك",
    'terms-content-8'=> "تمنحك RETURN-LY الحقوق المنصوص عليها هنا، رهناً بالشروط التالية: لن تستخدم الخدمات بأي طريقة يمكن أن تلحق الضرر أو تعطل أو تثقل كاهل الخدمات أو تضعف استخدامها أو تتعارض مع استخدام أي طرف آخر لها؛ لا يجوز لك تعديل أو تفكيك أو عكس هندسي أو تقليل شكل كل أو أي جزء من الخدمة إلى شكل يمكن إدراكه من قبل الإنسان ؛ قد لا تحاول الوصول غير المصرح به إلى أي حساب أو أنظمة حاسوبية أو شبكات مرتبطة بالخدمات ؛ توافق على عدم إرسال أو إرسال أي رسائل بريد إلكتروني أو مواد من خلال الخدمات التي تحتوي على فيروس أو أي عنصر ضار آخر ؛ لا يجوز لك الحصول على أي مواد أو معلومات أو محاولة الحصول عليها بأي وسيلة لا تتاح أو تقدم عن قصد عن طريق الخدمات ؛ لا يمكنك الوصول إلى جميع أو أي جزء من الخدمات من أجل بناء منتج أو خدمة تنافس الخدمة ؛ لا يجوز لك نسخ أو تخزين أو استنساخ أو تكرار أو إرسال أو توزيع جزء كبير من المحتوى على هذه الخدمة ؛ لا يجوز لك نسخ أو تقليد جزء أو كل تصميم أو تخطيط أو مظهر الخدمات أو أقسامها الفردية، بأي شكل أو وسيلة ؛ أنت مسؤول عن دقة ونوعية البيانات والمحتوى الذي تقدمه ؛ توافق على التصرف وفقاً لجميع القوانين والقواعد والأنظمة السارية ؛ أنت تقر أن لديك الأذونات اللازمة لاستخدام المحتوى المستخدم والتصريح به كما هو موضح هنا ؛ لن ترسل الرسائل غير المرغوب فيها أو السائبة أو غير المرغوب فيها ؛ لا يجب عليك جمع أو تخزين البيانات الشخصية عن المستخدمين الآخرين ما لم يكن مصرحًا به على وجه التحديد من قبل هؤلاء المستخدمين أو التماس المعلومات الشخصية من أي شخص أو التماس كلمات مرور أو معلومات التعريف الشخصية لأغراض تجارية أو غير قانونية ؛ ستستخدم جهودًا معقولة تجاريًا لمنع الوصول غير المصرح به إلى الخدمات والمحتوى المقدم على الخدمات أو استخدامها، وإخطار RETURN-LY على الفور بأي وصول أو استخدام غير مصرح به ؛ ولن تستخدم الخدمات لأي غرض غير قانوني أو لانتهاك أي قانون محلي أو قانون دولي أو مدونة سلوك أو أي مبادئ توجيهية أخرى قد تنطبق على الخدمات المقدمة. لا تخضع RETURN-LY لأي التزامات بالسرية فيما يتعلق بأي معلومات أو مواد يتم تقديمها عبر الإنترنت باستثناء ما هو محدد بخلاف ذلك في الشروط، أو على النحو المبين في أي أحكام وشروط إضافية تتعلق بمنتجات أو خدمات معينة، أو حسب ما يقتضيه القانون. إن الاستخدام التجاري، أو الاستنساخ، أو النقل أو التوزيع لأي معلومات أو برمجيات أو مواد أخرى متاحة من خلال الخدمات دون موافقة خطية مسبقة من RETURN-LY محظور تمامًا - حقوق الملكية والتراخيص.",

    'terms-content-title-9'=> "الترخيص المحدود",
    'terms-content-9'=> "تمنحك RETURN-LY ترخيصًا محدودًا وقابلاً للإلغاء وغير حصري وغير قابل للتخصيص وغير قابل للوصاية وحقًا في الوصول إلى الخدمات واستخدامها من خلال متصفح ويب متاح عمومًا أو جهاز محمول أو تطبيق، وعرض المعلومات واستخدام الخدمات التي نقدمها وفقًا للشروط. أي استخدام آخر للخدمات محظور تمامًا. نحن نحتفظ بجميع الحقوق غير الممنوحة صراحة في الشروط، بما في ذلك، دون قيود، حق الملكية وحقوق الملكية الفكرية وجميع الحقوق والمصالح الأخرى في الخدمات وجميع البنود ذات الصلة. جميع المواد المتاحة من خلال الخدمات والتي لا يقدمها مستخدمو الخدمات هي ملكية RETURN-LY والشركات المنتسبة و/أو المرخصين من الأطراف الثالثة، وهي محمية بحقوق التأليف والنشر والعلامات التجارية وحقوق الملكية الفكرية الأخرى. جميع العلامات التجارية وعلامات الخدمة والأسماء التجارية مملوكة لشركة RETURN-LY، أو الشركات التابعة و/أو المرخصين الخارجيين.",
    'terms-contact'=> 'تواصل: '
];